_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 259, 45, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 259, 45, 128)      1280      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 259, 9, 128)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 259, 9, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 259, 4, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 259, 4, 128)       147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 259, 2, 128)       0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 259, 256)          0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 259, 128)          295680    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 259, 512)          66048     
_________________________________________________________________
dropout_1 (Dropout)          (None, 259, 512)          0         
_________________________________________________________________
time_distributed_2 (TimeDist (None, 259, 256)          131328    
_________________________________________________________________
dropout_2 (Dropout)          (None, 259, 256)          0         
_________________________________________________________________
time_distributed_3 (TimeDist (None, 259, 128)          32896     
_________________________________________________________________
dropout_3 (Dropout)          (None, 259, 128)          0         
_________________________________________________________________
dense_4 (Dense)              (None, 259, 3)            387       
=================================================================
Total params: 822,787
Trainable params: 822,787
Non-trainable params: 0
_________________________________________________________________
